In [1]:
import pandas as pd

In [2]:
df_item_categories = pd.read_csv("data_kaggle/item_categories.csv") 
df_items = pd.read_csv("data_kaggle/items.csv") 
df_sales_train = pd.read_csv("data_kaggle/sales_train.csv") 
df_shops = pd.read_csv("data_kaggle/shops.csv") 
df_test = pd.read_csv("data_kaggle/test.csv")

# Merge tables

In [3]:
df_sales_train.head()

         date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0  02.01.2013               0       59    22154      999.00           1.0
1  03.01.2013               0       25     2552      899.00           1.0
2  05.01.2013               0       25     2552      899.00          -1.0
3  06.01.2013               0       25     2554     1709.05           1.0
4  15.01.2013               0       25     2555     1099.00           1.0

In [4]:
# Merge tables 'df_sales_train' and 'df_items' on item_id

In [5]:
df_sales_train.shape

(2935849, 6)

In [6]:
df_sales_train.isnull().sum()

date              0
date_block_num    0
shop_id           0
item_id           0
item_price        0
item_cnt_day      0
dtype: int64

In [7]:
df_merge = pd.merge(df_sales_train, df_items, on='item_id')

In [8]:
df_merge = df_merge[['date_block_num', 'shop_id', 'item_id','item_price','item_cnt_day','item_category_id']]

In [9]:
df_merge

,date_block_num,shop_id,item_id,item_price,item_cnt_day,item_category_id
0,0,59,22154,999.0,1.0,37
1,0,24,22154,999.0,1.0,37
2,0,27,22154,999.0,1.0,37
3,0,25,22154,999.0,1.0,37
4,0,25,22154,999.0,1.0,37
...,...,...,...,...,...,...
2935844,33,25,8428,249.0,1.0,40
2935845,33,25,7903,12198.0,1.0,15
2935846,33,25,7610,2890.0,1.0,64
2935847,33,25,7635,2100.0,1.0,64
2935848,33,25,7640,4040.0,1.0,64

In [10]:
df_merge_month = df_merge.groupby(['date_block_num','shop_id','item_id']).agg({'item_id':'mean','item_cnt_day': 'count', 'item_price':'mean', 
                                                              'item_category_id':'mean', 'shop_id':'mean', 'date_block_num': 'mean'})

In [11]:
df_merge_month

                                item_id  item_cnt_day  item_price  \
date_block_num shop_id item_id
0              0       32            32             4       221.0
                       33            33             3       347.0
                       35            35             1       247.0
                       43            43             1       221.0
                       51            51             2       128.5
...                                 ...           ...         ...
33             59      22087      22087             3       119.0
                       22088      22088             2       119.0
                       22091      22091             1       179.0
                       22100      22100             1       629.0
                       22102      22102             1      1250.0

                                item_category_id  shop_id  date_block_num
date_block_num shop_id item_id
0              0       32                     40        0               0
                       33                     37        0               0
                       35                     40        0               0
                       43                     40        0               0
                       51                     57        0               0
...                                          ...      ...             ...
33             59      22087                  83       59              33
                       22088                  83       59              33
                       22091                  83       59              33
                       22100                  42       59              33
                       22102                  42       59              33

[1609124 rows x 6 columns]

In [12]:
df_merge_train = df_merge_month[['shop_id','item_id','date_block_num','item_cnt_day']]

In [13]:
df_merge_train = df_merge_train.reset_index(drop=True)

In [14]:
df_train =df_merge_train.rename(columns = {'item_cnt_day':'item_cnt_month'})

In [15]:
df_train

         shop_id  item_id  date_block_num  item_cnt_month
0              0       32               0               4
1              0       33               0               3
2              0       35               0               1
3              0       43               0               1
4              0       51               0               2
...          ...      ...             ...             ...
1609119       59    22087              33               3
1609120       59    22088              33               2
1609121       59    22091              33               1
1609122       59    22100              33               1
1609123       59    22102              33               1

[1609124 rows x 4 columns]

# df_test

In [16]:
df_test

            ID  shop_id  item_id
0            0        5     5037
1            1        5     5320
2            2        5     5233
3            3        5     5232
4            4        5     5268
...        ...      ...      ...
214195  214195       45    18454
214196  214196       45    16188
214197  214197       45    15757
214198  214198       45    19648
214199  214199       45      969

[214200 rows x 3 columns]

In [17]:
df_test = pd.merge(df_test, df_items, on='item_id')

In [18]:
df_test['date_block_num'] = 34

In [19]:
df_test = df_test[['shop_id','item_id','date_block_num']]

In [20]:
df_test

        shop_id  item_id  date_block_num
0             5     5037              34
1             4     5037              34
2             6     5037              34
3             3     5037              34
4             2     5037              34
...         ...      ...             ...
214195       46      969              34
214196       41      969              34
214197       44      969              34
214198       39      969              34
214199       45      969              34

[214200 rows x 3 columns]

In [21]:
#df_test2 = pd.merge(df_test, df_train,  how='left', left_on=['shop_id','item_id'], right_on = ['shop_id','item_id'])

In [22]:
#df_test2

# Regression

In [23]:
X_df_train = df_train[['shop_id','item_id','date_block_num']]

In [24]:
y_df_train = df_train['item_cnt_month']

In [25]:
from sklearn.ensemble import RandomForestRegressor
from sklearn.feature_selection import RFECV
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import mean_squared_error

In [26]:
rf_classifier = RandomForestRegressor(n_estimators=500, max_depth=15, min_samples_leaf=3, 
                                       n_jobs=-1)

In [28]:
rf_classifier.fit(X_df_train, y_df_train)

RandomForestRegressor(bootstrap=True, ccp_alpha=0.0, criterion='mse',
                      max_depth=15, max_features='auto', max_leaf_nodes=None,
                      max_samples=None, min_impurity_decrease=0.0,
                      min_impurity_split=None, min_samples_leaf=3,
                      min_samples_split=2, min_weight_fraction_leaf=0.0,
                      n_estimators=500, n_jobs=-1, oob_score=False,
                      random_state=None, verbose=0, warm_start=False)

In [29]:
df_test

        shop_id  item_id  date_block_num
0             5     5037              34
1             4     5037              34
2             6     5037              34
3             3     5037              34
4             2     5037              34
...         ...      ...             ...
214195       46      969              34
214196       41      969              34
214197       44      969              34
214198       39      969              34
214199       45      969              34

[214200 rows x 3 columns]

In [37]:
y_pred = rf_classifier.predict(df_test)

In [38]:
y_pred

array([1.54582191, 1.4898175 , 1.55551554, ..., 1.04844754, 1.16224047,
       1.05168787])

In [39]:
x_pred = df_test.copy()
x_pred['item_cnt_month']= y_pred

In [40]:
x_pred

        shop_id  item_id  date_block_num  item_cnt_month
0             5     5037              34        1.545822
1             4     5037              34        1.489818
2             6     5037              34        1.555516
3             3     5037              34        1.483100
4             2     5037              34        1.475346
...         ...      ...             ...             ...
214195       46      969              34        1.091917
214196       41      969              34        1.127349
214197       44      969              34        1.048448
214198       39      969              34        1.162240
214199       45      969              34        1.051688

[214200 rows x 4 columns]

In [41]:
x_pred['ID'] = x_pred.index

In [42]:
submission = x_pred[['ID', 'item_cnt_month']]

In [43]:
submission.to_csv('outputs/submission3.csv', index=False)

In [ ]:
df_test = df_test[['shop_id','item_id', 'item_price', 'item_category_id_x','date_block_num_x']]

In [ ]:
df_test

In [ ]:
df_train = df_merge_train.groupby(['item_id','shop_id']).agg({'item_cnt_day':'mean', 'item_price':'mean', 
                                                              'item_category_id':'mean', 'item_id':'mean', 'shop_id':'mean'})

In [ ]:
df_train = df_train.reset_index(drop=True)

In [ ]:
df_train =df_train.rename(columns = {'item_cnt_day':'item_cnt_month'})

In [ ]:
df_train

In [ ]:
df_train['item_cnt_month'].value_counts()

In [ ]:
from sklearn.preprocessing import StandardScaler

# Your code here:
scaler = StandardScaler()
print(scaler.fit(df_merge))
X_diamonds_clean_scale = scaler.transform(X_diamonds_clean)
X_diamonds_clean_scale = pd.DataFrame(X_diamonds_clean_scale,columns=X_diamonds_clean.columns)
X_diamonds_clean_scale

In [ ]:
df_test

In [ ]:
df_sales_train

In [ ]:
df_shops